{
  "รายชื่อโรงไฟฟ้าในระบบ": [
    {
      "ชื่อย่อ": "BB-H3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเขื่อนขนาดใหญ่เขื่อนภูมิพล เครื่องที่ 3"
    },
    {
      "ชื่อย่อ": "BB-H7",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเขื่อนขนาดใหญ่เขื่อนภูมิพล เครื่องที่ 7"
    },
    {
      "ชื่อย่อ": "BB-H8",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเขื่อนขนาดใหญ่เขื่อนภูมิพล เครื่องที่ 8"
    },
    {
      "ชื่อย่อ": "BLCP-T",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนบริษัท บีแอลซีพี เพาเวอร์ จำกัด"
    },
    {
      "ชื่อย่อ": "BLCP-T1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนบริษัท บีแอลซีพี เพาเวอร์ จำกัด เครื่องที่ 1"
    },
    {
      "ชื่อย่อ": "BLCP-T2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนบริษัท บีแอลซีพี เพาเวอร์  จำกัด เครื่องที่ 2"
    },
    {
      "ชื่อย่อ": "BPK-C11",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบางปะกง ชุด 1 หน่วยผลิตที่ 1 "
    },
    {
      "ชื่อย่อ": "BPK-C12",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบางปะกง ชุด 1 หน่วยผลิตที่ 2"
    },
    {
      "ชื่อย่อ": "BPK-C5",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบางปะกง ชุดที่ 5"
    },
    {
      "ชื่อย่อ": "BPK-T3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนบางปะกง เครื่องที่ 3"
    },
    {
      "ชื่อย่อ": "BPK-T4",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนบางปะกง เครื่องที่ 4"
    },
    {
      "ชื่อย่อ": "CHN-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมจะนะ ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "CHN-C21",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมจะนะ ชุดที่ 2 หน่วยผลิตที่ 1"
    },
    {
      "ชื่อย่อ": "CHN-C22",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมจะนะ ชุดที่ 2 หน่วยผลิตที่ 2"
    },
    {
      "ชื่อย่อ": "GLOW-C",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท โกลว์ ไอพีพี จำกัด"
    },
    {
      "ชื่อย่อ": "GLOW-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท โกลว์ ไอพีพี จำกัด ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "GLOW-C2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท โกลว์ ไอพีพี จำกัด ชุดที่ 2"
    },
    {
      "ชื่อย่อ": "GNS-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ เจพี เอ็นเอส จำกัด ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "GNS-C2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ เจพี เอ็นเอส จำกัด ชุดที่ 2"
    },
    {
      "ชื่อย่อ": "GOC-T1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนบริษัท เก็คโค่-วัน จำกัด เครื่องที่ 1"
    },
    {
      "ชื่อย่อ": "GPD-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ พีดี จำกัด ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "GPD-C2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ พีดี จำกัด ชุดที่ 2"
    },
    {
      "ชื่อย่อ": "GPD-C3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ พีดี จำกัด ชุดที่ 3"
    },
    {
      "ชื่อย่อ": "GPD-C4",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ พีดี จำกัด ชุดที่ 4"
    },
    {
      "ชื่อย่อ": "GPS-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท โกลบอล เพาเวอร์ ซินเนอร์ยี่ จำกัด ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "GSRC-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ เอสอาร์ซี จำกัด ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "GSRC-C2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ เอสอาร์ซี จำกัด ชุดที่ 2"
    },
    {
      "ชื่อย่อ": "GSRC-C3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ เอสอาร์ซี จำกัด ชุดที่ 3"
    },
    {
      "ชื่อย่อ": "GSRC-C4",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ เอสอาร์ซี จำกัด ชุดที่ 4"
    },
    {
      "ชื่อย่อ": "GUT-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ เจพี ยูที จำกัด ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "GUT-C2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท กัลฟ์ เจพี ยูที จำกัด ชุดที่ 2"
    },
    {
      "ชื่อย่อ": "HHO-H1",
      "โรงไฟฟ้า": "โรงไฟฟ้าฮ้วยเฮาะเครื่องที่ 1"
    },
    {
      "ชื่อย่อ": "HHO-H2",
      "โรงไฟฟ้า": "โรงไฟฟ้าฮ้วยเฮาะเครื่องที่ 2"
    },
    {
      "ชื่อย่อ": "HKP-C",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท หินกองเพาเวอร์ จำกัด"
    },
    {
      "ชื่อย่อ": "HKP-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท หินกองเพาเวอร์ จำกัด ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "HSA-T",
      "โรงไฟฟ้า": "โรงไฟฟ้าลิกไนต์บริษัท ไฟฟ้าหงสา จำกัด (โรงไฟฟ้าหงสา)"
    },
    {
      "ชื่อย่อ": "HSA-T1",
      "โรงไฟฟ้า": "โรงไฟฟ้าลิกไนต์บริษัท ไฟฟ้าหงสา จำกัด (โรงไฟฟ้าหงสา) 1"
    },
    {
      "ชื่อย่อ": "HSA-T2",
      "โรงไฟฟ้า": "โรงไฟฟ้าลิกไนต์บริษัท ไฟฟ้าหงสา จำกัด (โรงไฟฟ้าหงสา) 2"
    },
    {
      "ชื่อย่อ": "HSA-T3",
      "โรงไฟฟ้า": "โรงไฟฟ้าลิกไนต์บริษัท ไฟฟ้าหงสา จำกัด (โรงไฟฟ้าหงสา) 3"
    },
    {
      "ชื่อย่อ": "KA-T1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนกระบี่ เครื่องที่ 1"
    },
    {
      "ชื่อย่อ": "KN-C21",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท ผลิตไฟฟ้าขนอม จำกัด ชุดที่ 2 หน่วยผลิตที่ 1"
    },
    {
      "ชื่อย่อ": "KN-C22",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท ผลิตไฟฟ้าขนอม จำกัด ชุดที่ 2 หน่วยผลิตที่ 2"
    },
    {
      "ชื่อย่อ": "KPG-C2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท แก่งคอยเพาเวอร์เจเนอเรชั่น จำกัด ชุดที่ 2"
    },
    {
      "ชื่อย่อ": "LTK-H1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำแบบสูบกลับลำตะคองชลภาวัฒนา เครื่องที่ 1"
    },
    {
      "ชื่อย่อ": "LTK-H2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำแบบสูบกลับลำตะคองชลภาวัฒนา เครื่องที่ 2"
    },
    {
      "ชื่อย่อ": "LTK-H3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำแบบสูบกลับลำตะคองชลภาวัฒนา เครื่องที่ 3"
    },
    {
      "ชื่อย่อ": "LTK-H4",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำแบบสูบกลับลำตะคองชลภาวัฒนา เครื่องที่ 4"
    },
    {
      "ชื่อย่อ": "MM-T10",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนแม่เมาะ เครื่องที่ 10"
    },
    {
      "ชื่อย่อ": "MM-T11",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนแม่เมาะ เครื่องที่ 11"
    },
    {
      "ชื่อย่อ": "MM-T12",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนแม่เมาะ เครื่องที่ 12"
    },
    {
      "ชื่อย่อ": "MM-T13",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนแม่เมาะ เครื่องที่ 13"
    },
    {
      "ชื่อย่อ": "MM-T14",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนแม่เมาะ เครื่องที่ 14"
    },
    {
      "ชื่อย่อ": "MM-T4",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนแม่เมาะ เครื่องที่ 4"
    },
    {
      "ชื่อย่อ": "MM-T8",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนแม่เมาะ เครื่องที่ 8"
    },
    {
      "ชื่อย่อ": "MM-T9",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนแม่เมาะ เครื่องที่ 9"
    },
    {
      "ชื่อย่อ": "NB-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมพระนครเหนือ ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "NB-C21",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมพระนครเหนือ ชุดที่ 2 หน่วยผลิตที่ 1"
    },
    {
      "ชื่อย่อ": "NB-C22",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมพระนครเหนือ ชุดที่ 2 หน่วยผลิตที่ 2"
    },
    {
      "ชื่อย่อ": "NNG2-H1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำ น้ำงึม 2 เครื่องที่ 1"
    },
    {
      "ชื่อย่อ": "NNG2-H2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำ น้ำงึม 2 เครื่องที่ 2"
    },
    {
      "ชื่อย่อ": "NNG2-H3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำ น้ำงึม 2 เครื่องที่ 3"
    },
    {
      "ชื่อย่อ": "NNP1-H",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำน้ำเงี้ยบ1"
    },
    {
      "ชื่อย่อ": "NNP1-H1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำน้ำเงี๊ยบ เครื่องที่ 1"
    },
    {
      "ชื่อย่อ": "NNP1-H2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำน้ำเงี้ยบ เครื่องที่ 2"
    },
    {
      "ชื่อย่อ": "NPO-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมน้ำพอง ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "NPO-C2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมน้ำพอง ชุดที่ 2"
    },
    {
      "ชื่อย่อ": "NTN1-H",
      "โรงไฟฟ้า": "โรงไฟฟ้าน้ำเทิน 1"
    },
    {
      "ชื่อย่อ": "NTN1-H1",
      "โรงไฟฟ้า": "โรงไฟฟ้าน้ำเทิน 1 หน่วยผลิตที่ 1"
    },
    {
      "ชื่อย่อ": "NTN1-H2",
      "โรงไฟฟ้า": "โรงไฟฟ้าน้ำเทิน 1 หน่วยผลิตที่ 2"
    },
    {
      "ชื่อย่อ": "NTN2-H",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำ น้ำเทิน 2"
    },
    {
      "ชื่อย่อ": "NTN2-H1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำ น้ำเทิน 2 เครื่องที่ 1"
    },
    {
      "ชื่อย่อ": "NTN2-H2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำ น้ำเทิน 2 เครื่องที่ 2"
    },
    {
      "ชื่อย่อ": "NTN2-H3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำ น้ำเทิน 2 เครื่องที่ 3"
    },
    {
      "ชื่อย่อ": "NTN2-H4",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำ น้ำเทิน 2 เครื่องที่ 4"
    },
    {
      "ชื่อย่อ": "RB-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท ผลิตไฟฟ้าราชบุรี จำกัด ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "RB-C2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท ผลิตไฟฟ้าราชบุรี จำกัด ชุดที่ 2"
    },
    {
      "ชื่อย่อ": "RB-C3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท ผลิตไฟฟ้าราชบุรี จำกัด ชุดที่ 3"
    },
    {
      "ชื่อย่อ": "RPCL-C1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท ราชบุรีเพาเวอร์ จำกัด ชุดที่ 1"
    },
    {
      "ชื่อย่อ": "RPCL-C2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมบริษัท ราชบุรีเพาเวอร์ จำกัด ชุดที่ 2"
    },
    {
      "ชื่อย่อ": "SB-C3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมพระนครใต้ ชุดที่ 3"
    },
    {
      "ชื่อย่อ": "SB-C41",
      "โรงไฟฟ้า": " โรงไฟฟ้าพลังความร้อนร่วมพระนครใต้ ชุดที่ 4 หน่วยผลิตที่ 1"
    },
    {
      "ชื่อย่อ": "SB-C42",
      "โรงไฟฟ้า": " โรงไฟฟ้าพลังความร้อนร่วมพระนครใต้ ชุดที่ 4 หน่วยผลิตที่ 2"
    },
    {
      "ชื่อย่อ": "THB-H",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเทิน-หินบุน"
    },
    {
      "ชื่อย่อ": "THB-H1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเทิน-หินบุน เครื่องที่ 1"
    },
    {
      "ชื่อย่อ": "THB-H2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเทิน-หินบุน เครื่องที่ 2"
    },
    {
      "ชื่อย่อ": "THB-H3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเทิน-หินบุน เครื่องที่ 3"
    },
    {
      "ชื่อย่อ": "TN-H2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเขื่อนขนาดใหญ่เขื่อนท่าทุ่งนา เครื่องที่ 2"
    },
    {
      "ชื่อย่อ": "WN-C4",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังความร้อนร่วมวังน้อย ชุดที่ 4"
    },
    {
      "ชื่อย่อ": "XPXN-H",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเซเปียน เซน้ำน้อย"
    },
    {
      "ชื่อย่อ": "XPXN-H1",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเซเปียน เซน้ำน้อย เครื่องที่ 1"
    },
    {
      "ชื่อย่อ": "XPXN-H2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเซเปียน เซน้ำน้อย เครื่องที่ 2"
    },
    {
      "ชื่อย่อ": "XPXN-H3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำเซเปียน เซน้ำน้อย เครื่องที่ 3"
    },
    {
      "ชื่อย่อ": "XYB-H",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำไซยะบุรี"
    },
    {
      "ชื่อย่อ": "XYB-H2",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำไซยะบุรี เครื่องที่ 2"
    },
    {
      "ชื่อย่อ": "XYB-H3",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำไซยะบุรี เครื่องที่ 3"
    },
    {
      "ชื่อย่อ": "XYB-H5",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำไซยะบุรี เครื่องที่ 5"
    },
    {
      "ชื่อย่อ": "XYB-H6",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำไซยะบุรี เครื่องที่ 6"
    },
    {
      "ชื่อย่อ": "XYB-H7",
      "โรงไฟฟ้า": "โรงไฟฟ้าพลังน้ำไซยะบุรี เครื่องที่ 7"
    }
  ]
}
